{"config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "name": "dense_1", "units": 7, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "tanh", "batch_input_shape": [null, 2]}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "name": "dense_2", "units": 4, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "name": "dense_3", "units": 7, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "tanh"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "name": "dense_4", "units": 4, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "name": "dense_5", "units": 7, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "tanh"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "name": "dense_6", "units": 4, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "name": "dense_7", "units": 7, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "tanh"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "name": "dense_8", "units": 4, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "name": "dense_9", "units": 7, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "tanh"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "name": "dense_10", "units": 1, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "sigmoid"}}]}, "keras_version": "2.3.0", "backend": "tensorflow", "class_name": "Sequential"}